# for project documents, use addtional latex styles used in proposal file
:edit-this:
#+EXPORT_FILE_NAME: dbms-lab3-report
#+PROPERTY: header-args :eval no-export
# don't prompt to evaluate code blocks while exporting
#+OPTIONS: toc:nil ^:{}
# set toc below instead of here
# 2nd option exports subscripts only when _{} is used
#+LATEX_HEADER: \graphicspath{{/home/sujal/programming/college-files/assets/images/}}

# !!!!!!!!!!!!!          only edit this section       !!!!!!
#+LATEX_HEADER: \def\subjectNum{1}
# 1: DBMS
# 2: NM
# 3: OS
# 4: SCR
# 5: S.Eng

#+LATEX_HEADER: \def\labNum{3}
#+LATEX_HEADER: \def\labTitle{Update query, Delete query \& sub-query}
#+LATEX_HEADER: \def\yearSem{II/IV}
#+LATEX_HEADER: \newif \iftoc
# !!!!!!!!!!!!           set toc here by uncommenting option
# \toctrue    
\tocfalse
:end:

#+INCLUDE: "/home/sujal/programming/college-files/assets/template.org" :lines "26-"
** Find all the bookname and author name where publication name is “Scholastic”.
#+begin_src sql :results raw :exports both :cache yes
  select bname, author from book
         where bid in (
               select isbn from booklist
                      where publication = 'Scholastic'
         )
#+end_src

#+RESULTS:
| bname                  | author          |
|------------------------+-----------------|
| Supermarket            | Bobby Hall      |
| Letters from my father | Barack Obama    |
| Death on the nile      | Agatha Christie |

** Find the teachers name and faculty who issued book on jan 1 ,2015.
#+begin_src sql :results raw :exports both :cache yes
  select name, faculty from teacher
         where tid in (
              select iid from issues
                     where dateofissue = '2015-01-15'
       )
#+end_src

#+RESULTS[4545722e2ab4325bdd291e74551647fd195e7850]:
| name        | faculty  |
|-------------+----------|
| Ram Singh   | computer |
| Shyam Singh | science  |

** Find the employee name whose salary is greater then 10000 and faculty is “computer”.
#+begin_src sql :results raw :exports both :cache yes
  select ename from employee
         where salary > 10000 
         AND eid in (
             select tid from teacher where faculty = 'computer'
         )
#+end_src

#+RESULTS[acf0050194f3e27bf663047fdf72f45282fa7935]:
| ename         |
|---------------|
| Madan Krishna |

** Find the Teacher’s name, and book name issued by the teacher whose name starts with “S”.

#+begin_src sql :cache yes :results raw :exports both 
  select issues.name as teacher_name, booklist.name as book_name
         from issues join booklist
              on issues.bid = booklist.isbn
         where issues.name like 'S%'
#+end_src

#+RESULTS[965c1bb3f563e1c1a89f730477a9df1df4cd9194]:
| teacher_name | book_name   |
|--------------+-------------|
| Shyam Singh  | Supermarket |

** Update all salary by 10%.
#+begin_src sql :results raw :exports both :cache yes
update employee set salary = salary * 110/100
select eid, salary from employee
#+end_src

#+RESULTS[d39b8f62c90ecfc34883e35e5ac43e7777741697]:
=Records affected: 4=
| eid | salary |
|-----+--------|
| 1   | 8800   |
| 2   | 9900   |
| 3   | 11000  |
| 4   | 16500  |

** Update the salary of all employee by 20% whose salary is less than 10000.
#+begin_src sql :results raw :exports both 
  update employee set salary = salary * 120/100
       where salary < 10000;
select eid, salary from employee;
#+end_src
#+RESULTS[02150af738e025d2245d9626a6e7de370524845c]:
=Records affected: 2=
| eid | salary |
|-----+--------|
|   1 |  10560 |
|   2 |  11880 |
|   3 |  11000 |
|   4 |  16500 |

** Use sub query to find all teachers name and faculty whose date of employ is jan 1, 2010
#+begin_src sql :results raw :exports both 
select name, faculty from teacher
       where tid in (
             select eid from employee where dateofemploy = '2010-01-01'
       )
#+end_src

#+RESULTS:
| name        | faculty  |
|-------------+----------|
| Ram Singh   | computer |
| Shyam Singh | science  |

